nishantbhange/Driver_Dev/Driver_stm32f404xx/Driver/inc/stm32f40xx_spi_driver.h
/*
 * stm32f40xx_spi_driver.h
 *
 *  Created on: Oct 4, 2025
 *      Author: nisha
 */

#ifndef DRIVER_INC_STM32F40XX_SPI_DRIVER_H_
#define DRIVER_INC_STM32F40XX_SPI_DRIVER_H_
#include<stdint.h>
#include"stm32f407xx.h"

#define SPI_MASTER_MODE 1
#define SPI_SLAVE_MODE  0

#define SPI_FULL_DUPLEX  1
#define SPI_HALF_DUPLEX  2
#define SPI_SIMPLEX_RX   3

#define SPI_READY_STATE 0
#define SPI_BSY_RX_STATE 1
#define SPI_BSY_TX_STATE 2

#define SPI_EVENT_TX_CMPLT 0
#define SPI_EVENT_RX_CMPLT 1
#define SPI_EVENT_OVR_ERR 2

#define SPI_CLK_SPEED_DIV_2  0
#define SPI_CLK_SPEED_DIV_4  1
#define SPI_CLK_SPEED_DIV_8   2
#define SPI_CLK_SPEED_DIV_16  3
#define SPI_CLK_SPEED_DIV_32   4
#define SPI_CLK_SPEED_DIV_64   5
#define SPI_CLK_SPEED_DIV_128  6
#define SPI_CLK_SPEED_DIV_256  7

#define SPI_CPOL_RESET 0
#define SPI_CPOL_SET 1

#define SPI_CPHA_RESET 0
#define SPI_CPHA_SET 1

#define SPI_8_BIT_DFF 0
#define SPI_16_BIT_DFF 1

#define SPI_SSM_EN  1
#define SPI_SSM_DI  0

#define SPI_SSI_SET  1
#define SPI_SSI_RESET  0



typedef struct{
	uint8_t Spi_Device_Mode;
	uint8_t Spi_Bus_Config;
	uint8_t Spi_Sclk_Speed;
	uint8_t Spi_Dff;
	uint8_t Spi_Cpol;
	uint8_t Spi_Cpha;
	uint8_t Spi_Ssm;
	uint8_t Spi_Ssi;

}Spi_Config_Def;

typedef struct{
	uint32_t SPI_CR1;
	uint32_t SPI_CR2;
	uint32_t SPI_SR;
	uint32_t SPI_DR;
	uint32_t SPI_CRCPR;
	uint32_t SPI_RXCRCR;
	uint32_t SPI_TXCRCR;
	uint32_t SPI_I2SCFGR;
	uint32_t SPI_I2SPR;

}Spi_Reg_Def;

typedef struct{

	Spi_Reg_Def *Pspix ;
	Spi_Config_Def Spi_Config;
	uint8_t *PTx_Buffer;
	uint8_t *PRx_Buffer;
	uint8_t TX_Len;
	uint8_t RX_Len;
	uint8_t TX_State;
	uint8_t RX_State;


}Spi_Handle_t;



void Spi_Periph_Clk_Control(Spi_Reg_Def *Pspix,uint8_t EnorDI);
void Spi_Init(Spi_Handle_t *Pspix_Handle);
void Spi_Dinit(Spi_Reg_Def *Pspix,Rcc_Reg_Def*);
void Spi_Send_Data(Spi_Reg_Def *Pspix,uint8_t *pTXbuffer,uint32_t length);
void Spi_Recieve_Data(Spi_Reg_Def *Pspix,uint8_t *pRXbuffer,uint32_t length);

uint8_t Spi_Send_Data_IT(Spi_Handle_t *SPI,uint8_t *pTXbuffer,uint32_t length);
uint8_t Spi_Recieve_Data_IT(Spi_Handle_t *SPI,uint8_t *pRXbuffer,uint32_t length);

void Spi_Irq_Config(uint8_t Irq_No,uint8_t Priority,uint8_t EnorDi);
void Spi_Irq_Handling(Spi_Handle_t *Pspix_Handle);

void Spi_Periph_Cntrl(Spi_Reg_Def * Pspix,uint8_t En_Di);

void Spi_Ssoe_cntrl(Spi_Reg_Def *SPI,uint8_t ENorDI );

void SPI_Clear_OVR_Flag(Spi_Handle_t *Pspix_Handle);
void SPI_Close_TX(Spi_Handle_t *Pspix_Handle);
void SPI_Close_RX(Spi_Handle_t *Pspix_Handle);

void SPI_ApplicationEventCallback(Spi_Handle_t *Pspix_Handle, uint8_t Appli_Eve);
#endif /* DRIVER_INC_STM32F40XX_SPI_DRIVER_H_ */
